import React from 'react'
import styles from "./Payment.module.css"
import DoneOutlineIcon from '@mui/icons-material/DoneOutline';
import LockOutlinedIcon from '@mui/icons-material/LockOutlined';
import { useNavigate } from 'react-router-dom';

const Booking = () => {
  let navigate= useNavigate()
  return (
    <div className={styles.booking}>
    <h3>Важлива інформація про ваше бронювання</h3>

    <div>
        <ul>
            <li>Скасування або зміни, здійснені після 14:00 (за місцевим часом готелю) 19 травня 2022 року або неприбуття, підлягають збору, що дорівнює 100% від загальної суми, сплаченої за бронювання..</li>
            <li>Місце реєстрації заїзду відрізняється від місця проживання. Щоб зареєструватися, перейдіть до Реєстрація в номері Щоб домовитися про реєстрацію, зв’яжіться з готелем завчасно, скориставшись контактною інформацією з підтвердження бронювання.
              Якщо ви збираєтеся прибути після опівночі, будь ласка, зв'яжіться з готелем заздалегідь, скориставшись контактною інформацією з підтвердження бронювання.
Гості, які планують прибути в неробочий час стійки реєстрації, повинні заздалегідь зв'язатися з адміністрацією, щоб отримати інструкції щодо реєстрації заїзду.
              Персонал стійки реєстрації зустріне гостей після прибуття. Під час реєстрації заїзду гості повинні надати довідку про повну вакцинацію проти COVID-19.
              Гості, які надають документи про вакцинацію, повинні отримати повну вакцинацію проти COVID-19 принаймні за 3 дні до заїзду..</li>
            <li>Щоб зареєструватися в цьому готелі, гості, які є громадянами Індії, повинні надати дійсне посвідчення особи з фотографією, видане урядом Індії. мандрівники, які не є громадянами Індії, повинні пред'явити дійсний паспорт і візу</li>
        </ul>
    </div>
    <p>Натискаючи кнопку нижче, я підтверджую, що переглянув <span style={{color:"#0a438b"}} >Заява про конфіденційність</span> Відкриється в новому вікні та <span style={{color:"#0a438b"}} >з'являється державні поради щодо подорожей</span> відкриється в новому вікні. Переглянули та прийняти <span style={{color:"#0a438b",textDecoration:"underline"}} >Правила та обмеження</span> відкриється в новому вікні. and <span style={{color:"#0a438b",textDecoration:"underline"}} >Умови користування</span> відкриється в новому вікні..</p>
    <div className={styles.due} >
    <DoneOutlineIcon style={{ height:"max-content", fontSize:"18px",color:"green"}} />
    <span style={{color:"#0a438b",textDecoration:"underline",fontWeight:"500"}} >$0.00 due now</span>
    <DoneOutlineIcon style={{fontSize:"18px",color:"green",height:"max-content"}}/>
    <p style={{color:"darkgreen"}}>Зміна планів? Без проблем. Ви можете скасувати безкоштовно раніше <span style={{color:"#0a438b",textDecoration:"underline",fontWeight:"500"}} >Четверг 19 травня</span></p>
    </div>
    <button onClick={()=>navigate("/paymentsucessful")}>Complete Booking</button>
    <p style={{color:"grey"}}><LockOutlinedIcon style={{height:"16px",weight:"16px"}}/>Ми використовуємо безпечну передачу та зашифроване сховище для захисту вашої особистої інформації. <br /> &nbsp; &nbsp;&nbsp;Цей платіж буде оброблено в США. Це не стосується випадків, коли постачальник подорожей (авіакомпанія/готель/залізниця тощо)<br/>&nbsp;&nbsp;&nbsp; обробляє ваш платіж. </p>
  
</div>
  )
}

export default Booking